blaugold.melos-code
bradlc.vscode-tailwindcss
cschlosser.doxdocgen
Dart-Code.dart-code
Dart-Code.flutter
dbaeumer.vscode-eslint
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
felixfbecker.php-intellisense
foxundermoon.shell-format
GitHub.copilot
GitHub.copilot-chat
GitHub.remotehub
github.vscode-github-actions
GitHub.vscode-pull-request-github
golang.go
infeng.vscode-react-typescript
jdinhlife.gruvbox
jeff-hykin.better-cpp-syntax
ms-azuretools.vscode-docker
ms-edgedevtools.vscode-edge-devtools
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.github-issues-prs
ms-vscode.live-server
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-pack
redhat.vscode-yaml
rkoubou.ksp
rust-lang.rust-analyzer
sainnhe.gruvbox-material
Shopify.theme-check-vscode
spoonscen.es6-mocha-snippets
stevejpurves.cucumber
tamasfe.even-better-toml
timonwong.shellcheck
twxs.cmake
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscodevim.vim
xdebug.php-debug
xdebug.php-pack
yatki.vscode-surround
zobo.php-intellisense
