# Add Homebrew taps
tap 'blackfireio/homebrew-blackfire'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/tex'
tap 'homebrew/versions'

# Install packages from Homebrew core
brew 'awscli'
brew 'bats'
brew 'blackfire-agent'
brew 'diff-so-fancy'
brew 'fish'
brew 'git'
brew 'gitup'
brew 'homebrew/completions/brew-cask-completion'
brew 'homebrew/dupes/openssh'
brew 'homebrew/php/composer'
brew 'homebrew/php/php70'
brew 'imagemagick'
brew 'jmeter'
brew 'jq'
brew 'mas'
brew 'node@6'
brew 'openssh'
brew 'packer'
brew 'php-code-sniffer'
brew 'phpmd'
brew 'shellcheck'
brew 'terraform'
brew 'tmux'
brew 'vim', args: ['--with-override-system-vi']

# Install packages from casks
cask_args appdir: '/Applications'

cask 'atom'
cask 'caret'
cask 'chefdk'
cask 'cyberduck'
cask 'docker'
cask 'dropbox'
cask 'electron-api-demos'
cask 'electron'
cask 'firefox'
cask 'font-inconsolata'
cask 'font-liberation-sans'
cask 'font-libre-baskerville'
cask 'font-merriweather'
cask 'font-montserrat'
cask 'font-open-sans'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'gitup'
cask 'google-chrome'
cask 'google-drive'
cask 'google-hangouts'
cask 'hyper'
cask 'invisionsync'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'kaleidoscope'
cask 'kitematic'
cask 'postman'
cask 'rstudio'
cask 'screaming-frog-seo-spider'
cask 'sequel-pro'
cask 'sketch'
cask 'spectacle'
cask 'tableau-public'
cask 'vagrant'
cask 'virtualbox'
cask 'wireshark'
cask 'xmind'

# Install App Store apps
mas 'Be Focused', id: 973134470
mas 'CCMenu', id: 603117688
mas 'Electron APIs', id: 1119345146
mas 'Evernote', id: 406056744
mas 'Helm', id: 1099472017
mas 'Install macOS Sierra', id: 1127487414
mas 'Keynote', id: 409183694
mas 'Monit', id: 1014850245
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Skitch', id: 425955336
mas 'Slack', id: 803453959
mas 'Spectacle', id: 443987910
mas 'Svgsus', id: 1106867065
mas 'The Unarchiver', id: 425424353
mas 'Todoist', id: 585829637
mas 'Transmit', id: 403388562
mas 'Xcode', id: 497799835
