# Add Homebrew taps
tap '1password/1password-cli'
tap 'homebrew/bundle'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'thoughtbot/formulae'

# Install packages from Homebrew core
brew 'awscli'
brew 'bash'
brew 'bats'
brew 'direnv'
brew 'fpp'
brew 'gh' # GitHub CLI
brew 'git'
brew 'git-delta' # delta pager for better diffs (https://github.com/dandavison/delta)
brew 'git-open'
brew 'gpg'
brew 'httpie'
brew 'jq'
brew 'less' # Install more recent version of less pager
brew 'mas'
brew 'node'
brew 'openssh'
brew 'pinentry-mac'
brew 'rcm'
brew 'rg' # ripgrep for better grep searches (https://github.com/BurntSushi/ripgrep/)
brew 'shellcheck'
brew 'starship'
brew 'svn'
brew 'terminal-notifier'
brew "wget"
brew 'vim'
brew 'volta'
brew 'zsh'

# Install packages from casks
cask_args appdir: '/Applications'

cask '1password'
cask '1password-cli'
cask 'charles'
cask 'cyberduck'
cask 'docker'
cask 'firefox'
cask 'font-courier-prime'
cask 'font-courier-prime-code'
cask 'font-courier-prime-medium-and-semi-bold'
cask 'font-courier-prime-sans'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-mono-nerd-font'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-hack-nerd-font'
cask 'font-inconsolata'
cask 'font-liberation-sans'
cask 'font-libre-baskerville'
cask 'font-merriweather'
cask 'font-montserrat'
cask 'font-open-sans'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'gitup'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'kaleidoscope'
cask 'postman'
cask 'visual-studio-code'

# Install App Store apps
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Xcode', id: 497799835
