# Add Homebrew taps
tap 'caskroom/cask'
tap 'caskroom/drivers'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/science'
tap 'homebrew/versions'
tap 'thoughtbot/formulae'

# Install packages from Homebrew core
brew 'awscli'
brew 'bash'
brew 'bats'
brew 'diff-so-fancy'
brew 'fish'
brew 'fpp'
brew 'git'
brew 'git-open'
brew 'gpg'
brew 'homebrew/completions/brew-cask-completion'
brew 'imagemagick'
brew 'jq'
brew "lastpass-cli", args: ["with-pinentry"]
brew 'mas'
brew 'node'
brew 'nodenv'
brew 'openssh'
brew 'pinentry-mac'
brew "ruby-build"
brew 'rbenv'
brew 'rcm'
brew 'shellcheck'
brew 'terminal-notifier'
brew 'tmux'
brew "wget"
brew 'vim', args: ['--with-override-system-vi']

brew "blackfireio/blackfire/blackfire-agent"
brew "homebrew/php/composer"
brew "homebrew/php/php71-imagick"
brew "homebrew/php/php71-intl"
brew "homebrew/php/php71-mcrypt"
brew "homebrew/php/php71-redis"

# Install packages from casks
cask_args appdir: '/Applications'

cask "alfred"
cask 'atom'
cask 'charles'
cask 'chefdk'
cask 'cyberduck'
cask 'docker'
cask 'firefox'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-sans'
cask 'font-inconsolata'
cask 'font-liberation-sans'
cask 'font-libre-baskerville'
cask 'font-merriweather'
cask 'font-montserrat'
cask 'font-open-sans'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'gitup'
cask 'google-chrome'
cask "graphiql"
cask 'hyper'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'kaleidoscope'
cask "ngrok"
cask 'postman'
cask 'sequel-pro'
cask 'spectacle'
cask 'vagrant'
cask 'virtualbox'

# Install App Store apps
mas 'Keynote', id: 409183694
mas "LastPass", id: 926036361
mas "LittleIpsum", id: 405772121
mas "Medis", id: 1063631769
mas 'Monit', id: 1014850245
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Slack', id: 803453959
mas 'Spectacle', id: 443987910
mas 'The Unarchiver', id: 425424353
mas 'Xcode', id: 497799835
